FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Flash.c
    /* Transfer Firmware to the FCU RAM. To use FCU commands, the FCU firmware
     must be stored in the FCU RAM. */

    /* Before writing data to the FCU RAM, clear FENTRYR to stop the FCU. */
    if (FLASH.FENTRYR.WORD != 0x0000) {
        /* Disable the FCU from accepting commands - Clear both the
         FENTRY0(ROM) and FENTRYD(Data Flash) bits to 0 */
        FLASH.FENTRYR.WORD = 0xAA00;
    }

    /* Enable the FCU RAM */
    FLASH.FCURAME.WORD = 0xC401;

    /* Copies the FCU firmware to the FCU RAM.
     Source: H'FEFFE000 to H'FF00000 (FCU firmware area)
     Destination: H'007F8000 to H'007FA000 (FCU RAM area) */
    /* Set source pointer */
    src = (uint32_t *)FCU_PRG_TOP;

    /* Set destination pointer */
    dst = (uint32_t *)FCU_RAM_TOP;

    /* Iterate for loop to copy the FCU firmware */
    for (i = 0; i < (FCU_RAM_SIZE / 4); i++) {
        /* Copy data from the source to the destination pointer */
        *dst = *src;

        /* Increment the source and destination pointers */
        src++;
        dst++;
    }

    /* FCU firmware transfer complete, set the flag to 1 */
    fcu_transfer_complete = 1;

    /* Return 0, no errors */
    return 0;
}
/******************************************************************************
 End of function  _Flash_Init
 ******************************************************************************/

/******************************************************************************
 * Function Name: _DataFlash_Status_Clr
 * Description  : Clear the status of the Data Flash operation.
 NOTE: This function does not have to execute from in RAM.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _DataFlash_Status_Clr(void)
{
    /* Declare temporaty pointer */
    volatile uint8_t *ptrb;

    /* Set pointer to Data Flash to issue a FCU command if needed */
    ptrb = (uint8_t *)(DF_ADDRESS);

    /* Check to see if an error has occurred with the FCU.  If set, then
     issue a status clear command to bring the FCU out of the
     command-locked state */
    if (FLASH.FSTATR0.BIT.ILGLERR == 1) {
        /* FASTAT must be set to 0x10 before the status clear command
         can be successfully issued  */
        if (FLASH.FASTAT.BYTE != 0x10) {
            /* Set the FASTAT register to 0x10 so that a status clear
             command can be issued */
            FLASH.FASTAT.BYTE = 0x10;
        }
    }

    /* Issue a status clear command to the FCU */
    *ptrb = 0x50;
}
/******************************************************************************
 End of function  _DataFlash_Status_Clr
 ******************************************************************************/

/******************************************************************************
 * Function Name: _DataFlash_Write
 * Description  : Write either 8-bytes of 128-bytes to Data Flash area.
 NOTE: This function does not have to execute from in RAM.
 * Arguments    :
 address
 The address (in the Data Flash programming area) to write the data to
 data
 The address of the data to write
 size
 The size of the data to write. Must be set to either '8' or '128'
 * Return Value :
 0x00 = Operation Successful
 0x01 = Operation Failed
 ******************************************************************************/
static uint8_t _DataFlash_Write(uint32_t address, uint32_t data, uint8_t size)
{
    /* Declare wait counter variable */
    int32_t wait_cnt;

    /* Define loop iteration count variable */
    uint8_t n = 0;

    /* Check data size is valid */
    if ((size == 2)) {
        /* Perform bit shift */
        size = size >> 1;

        /* Send command to data flash area */
        *(volatile uint8_t *)DF_ADDRESS = 0xE8;

        /* Specify data transfer size to data flash area */
        *(volatile uint8_t *)DF_ADDRESS = size;

        /* Iterate through the number of data bytes */
        while (n++ < size) {
            /* Copy data from source address to destination area */
            *(volatile uint16_t *)address = *(uint16_t *)data;

            /* Increment data address by two bytes */
            data += 2;
        }

        /* Write the final FCU command for programming */
        *(volatile uint8_t *)(DF_ADDRESS) = 0xD0;

        /* Set the wait counter with timeout value */
        wait_cnt = WAIT_MAX_DF_WRITE;

        /* Check if FCU has completed its last operation */
        while (FLASH.FSTATR0.BIT.FRDY == 0) {
            /* Decrement the wait counter */
            wait_cnt--;

            /* Check if the wait counter has reached zero */
            if (wait_cnt == 0) {
                /* Maximum time for writing a block has passed,
                 operation failed, reset FCU */
                _Flash_Reset();

                /* Return 1, operation failure */
                return 1;
            }
        }

        /* Check for illegal command or programming errors */
        if ((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR == 1)) {
            /* Return 1, operation failure */
            return 1;
        }
    }
    /* Data size is invalid */
    else {
        /*Return 1, operation failure */
        return 1;
    }

    /* Return 0, operation success */
    return 0;
}
/******************************************************************************
 End of function  _DataFlash_Write
 ******************************************************************************/

/******************************************************************************
 * Function Name: R_FlashDataAreaBlankCheck
 * Description  :
 NOTE: This function does not have to execute from in RAM.
 * Arguments    :
 address
 The address to check if is blank.
 If the parameter 'size'=='BLANK_CHECK_8_BYTE', this should be set to an
 8-byte address boundary.
 If the parameter 'size'=='BLANK_CHECK_ENTIRE_BLOCK', this should be set
 to a defined Data Block Number ('BLOCK_DB0', 'BLOCK_DB1', etc...)
 size
 This specifies if you are checking an 8-byte location, or an entire
 block. You must set this to either 'BLANK_CHECK_8_BYTE' or
 'BLANK_CHECK_ENTIRE_BLOCK'.
 * Return Value :
 0x00 = Blank
 0x01 = Not Blank
 0x02 = Operation Failed
 ******************************************************************************/
uint8_t R_FlashDataAreaBlankCheck(uint32_t address, uint8_t size)
{
    /* Declare data flash pointer */
    volatile uint8_t *ptrb;

    /* Declare result container variable */
    uint8_t result;

    /* Set current FCU mode to Data Flash PE Mode */
    current_mode = FLD_PE_MODE;

    /* Enter Data Flash PE mode in the FCU */
    if (_Enter_PE_Mode(address, 0) != 0) {
        /* FCU failed to enter PE mode, set mode to READ */
        current_mode = READ_MODE;

