FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Flash.c
    /* Return flash programming result */
    return result;
}
/******************************************************************************
 End of function  R_FlashWrite
 ******************************************************************************/

/******************************************************************************
 * Function Name: _Notify_Peripheral_Clock
 * Description  : Notifies FCU or Peripheral Clock (PCLK)
 NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
 but if you are ONLY doing Data Flash programming, this function can reside
 and execute in Flash.
 * Arguments    :
 flash_addr
 Flash address you will be erasing or writing to
 * Return Value :
 0x00 = Operation Successful
 0x01 = Operation Failed
 ******************************************************************************/
static uint8_t _Notify_Peripheral_Clock(volatile uint8_t * flash_addr)
{
    /* Declare wait counter variable */
    int32_t wait_cnt;

    /* Notify Peripheral Clock(PCK) */
    /* Set frequency of PCK */
    FLASH.PCKAR.WORD = PCLK_FREQUENCY/1000000;

    /* Execute Peripheral Clock Notification Commands */
    *flash_addr = 0xE9;
    *flash_addr = 0x03;
    *(uint16_t *)flash_addr = 0x0F0F;
    *(uint16_t *)flash_addr = 0x0F0F;
    *(uint16_t *)flash_addr = 0x0F0F;
    *flash_addr = 0xD0;

    /* Set timeout wait duration */
    wait_cnt = WAIT_t10USEC;

    /* Check FRDY */
    while (FLASH.FSTATR0.BIT.FRDY == 0) {
        /* Decrement wait counter */
        wait_cnt--;

        /* Check if wait counter has reached zero */
        if (wait_cnt == 0) {
            /* Timeout duration elapsed, assuming operation failure - Reset
             FCU */
            _Flash_Reset();

            /* Return 1, operation failure  */
            return 1;
        }
    }

    /* Check ILGLERR */
    if (FLASH.FSTATR0.BIT.ILGLERR == 1) {
        /* Return 1, operation failure*/
        return 1;
    }

    /* Return 1, operation success */
    return 0;
}
/******************************************************************************
 End of function _Notify_Peripheral_Clock
 ******************************************************************************/

/******************************************************************************
 * Function Name: _Flash_Reset
 * Description  : Reset the FCU.
 NOTE: This function MUST execute from in RAM for 'ROM Area' programming,
 but if you are ONLY doing Data Flash programming, this function can reside
 and execute in Flash.
 * Arguments    : none
 * Return Value : none
 ******************************************************************************/
static void _Flash_Reset(void)
{
    /* Declare wait counter variable */
    int32_t wait_cnt;

    /* Reset the FCU */
    FLASH.FRESETR.WORD = 0xCC01;

    /* Give FCU time to reset */
    wait_cnt = WAIT_tRESW;

    /* Wait until the timer reaches zero */
    while (wait_cnt != 0) {
        /* Decrement the timer count each iteration */
        wait_cnt--;
    }

    /* FCU is not reset anymore */
    FLASH.FRESETR.WORD = 0xCC00;
}
/******************************************************************************
 End of function  _Flash_Reset
 ******************************************************************************/
void R_Exit_Programming(void)
{
    _Exit_PE_Mode();
}
void R_Flash_Reset(void)
{
    _Flash_Reset();
}
uint8_t R_Flash_Init(void)
{
    return (_Flash_Init());
}
uint8_t R_Flash_Status_Check(uint32_t wait_cnt)
{
    /* Check if FCU has completed its last operation. If not, wait till timeout*/
    while (FLASH.FSTATR0.BIT.FRDY == 0) {
        /* Decrement the wait counter */
        wait_cnt--;

        /* Check if the wait counter has reached zero */
        if (wait_cnt == 0) {
            /* Maximum time for writing a block has passed,
             operation failed, reset FCU */
            R_Flash_Reset();

            /* Return 1, operation failure */
            return 1;
        }
    }

    /* Check for illegal command or programming errors */
    if ((FLASH.FSTATR0.BIT.ILGLERR == 1) || (FLASH.FSTATR0.BIT.PRGERR == 1)) {
        /* Return 1, operation failure */
        return 1;
    }
    return 0;
}

/*******************************************************************************
 * Global Variables
 *******************************************************************************/
/* Flash write buffer array */
uint8_t gFlashWriteBuffer[16];
/* Flash write address location global variable */
uint32_t gFlashWriteAddr;

/*******************************************************************************
 * Local Function Prototypes
 *******************************************************************************/
/* ADC initialisation function prototype declaration */
static void InitADC_FlashData(void);

/*******************************************************************************
 * Outline      : Flash_InitData
 * Description  : This function initialises the MCU flash area, allowing it to be
 *                 read and written to by user code. The function then calls the
 *                 InitADC_FlashData function to configure the ADC unit used in
 *                 the project. Finally the function erases the contents of the
 *                 data flash.
 * Argument     : none
 * Return value : none
 *******************************************************************************/
void Flash_Open(void)
{
    /* Enable MCU access to the data flash area */
    R_FlashDataAreaAccess(0xFFFF, 0xFFFF);

    /* Initialise the ADC unit */
    InitADC_FlashData();

    /* Erase flash memory before writing to it */
    //Flash_ChipErase();
}

/*******************************************************************************
 * Outline      : Flash_ChipErase
 * Description  : This function enters a for loop, and erases blocks of data
 *                 flash memory each iteration until all blocks have been erased.
 * Argument     : none
 * Return value : none
 *******************************************************************************/
uint8_t Flash_ChipErase(void)
{
    /* Declare flash API error flag */
    uint8_t ret = 0;
	
