FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_Flash.c
	/* Declare loop count and block count variables */
	uint32_t loop_counter = 0, block_count = BLOCK_DB0;
	uint32_t address = 0x00000000;

    R_FlashDataAreaAccess(0xFFFF, 0xFFFF);

    /* Initialise a for loop to erase each of the data flash blocks */
    for (loop_counter = 0; loop_counter < DF_NUM_BLOCKS; loop_counter++) {
        /* Fetch beginning address of DF block */
        address = block_addresses(BLOCK_DB0 + loop_counter);

        /* Erase data flash block */
        ret |= R_FlashErase(block_count);

        /* Check if data flash area is blank */
        ret |= R_FlashDataAreaBlankCheck(address, BLANK_CHECK_ENTIRE_BLOCK);

        /* Increment block counter */
        block_count++;
    }

    /* Check Blank Checking */
    ret |= R_FlashDataAreaBlankCheck(address, BLANK_CHECK_ENTIRE_BLOCK);

    R_Flash_Status_Check(WAIT_MAX_DF_WRITE);

    /* Halt in while loop when flash API errors detected */
    //while (ret);
    return ret;
}

/*******************************************************************************
 * Outline      : Flash_Write
 * Description  : This function writes the given contents to the
 *                 dataflash, at the given location. If the
 *                 number of bytes to write to flash is not a multiple of 8, the
 *                 data is padded with null bytes (0x00) to make up to the
 *                 nearest multiple of 8.
 * Argument     : offset -- Offset byte from start of flash
 *                aData -- Pointer to bytes to write to flash
 *                aSize -- number of bytes to write to flash
 * Return value : 0 = success, else failure
 *******************************************************************************/
uint8_t Flash_Write(uint16_t offset, uint8_t *aData, uint16_t aSize)
{
	uint16_t num_bytes;
	
    /* Declare flash API error flag */
    uint8_t ret = 0;

    /* Declare data padding array and loop counter */
    uint8_t pad_buffer[256];

    /* Declare pointer to flash write location */

    uint32_t * flash_ptr;

    gFlashWriteAddr = (uint32_t)(DF_START_ADDR + offset);
    flash_ptr = (uint32_t *)gFlashWriteAddr;

    /* Declare the number of bytes variable, and initialise with the number of
     bytes the variable gFlashWriteBuffer contains */
    num_bytes = aSize; // sizeof(gFlashWriteBuffer);

    /* Clear the contents of the flash write buffer array */
    memset(pad_buffer, 0x00, 256);

    /* Copy contents of the write buffer to the padding buffer */
    memcpy((char*)pad_buffer, (char*)aData, num_bytes);

    /* Check if number of bytes is greater than 256 */
    if (num_bytes > 256) {
        /* Number of bytes to write too high, set error flag to 1 */
        ret |= 1;
    }
    /* Check if number of bytes to write is a multiple of 8 */
    else if (num_bytes % 8u) {
        /* Pad the data to write so it makes up to the nearest multiple of 8 */
        num_bytes += 8u - (num_bytes % 8u);
    }

    /* Halt in while loop when flash API errors detected */
    while (ret)
        ;

    /* Write contents of write buffer to data flash */
    ret |= R_FlashWrite(gFlashWriteAddr, (uint32_t)pad_buffer, num_bytes);

    /* Compare memory locations to verify written data */
    ret |= memcmp(aData, flash_ptr, aSize);

    /* Halt in while loop when flash API errors detected */
    return ret;
}

uint8_t Flash_Read(uint16_t offset, uint8_t *aData, uint16_t aSize)
{
    uint8_t * flash_ptr;

    gFlashWriteAddr = (uint32_t)(DF_START_ADDR + offset);
    flash_ptr = (uint8_t *)gFlashWriteAddr;
    memcpy(aData, flash_ptr, aSize);

    return 0;
}

/*******************************************************************************
 * Outline      : Flash_Erase
 * Description  : This function enters a for loop, and erases blocks of data
 *                 flash memory that cover the given address range.  This
 *                 routine is not smart enough to keep the existing data
 *                 in a block that is erased.
 * Argument     : none
 * Return value : none
 *******************************************************************************/
uint8_t Flash_Erase(uint16_t offset, uint16_t aSize)
{
    /* Declare flash API error flag */
    uint8_t ret = 0;
    /* Declare loop count and block count variables */
    uint32_t loop_counter = 0, block_count = BLOCK_DB0;
    uint32_t address = 0x00000000;
    uint32_t end_address;
    uint32_t offset_address = offset + block_addresses(BLOCK_DB0);

    R_FlashDataAreaAccess(0xFFFF, 0xFFFF);

    /* Initialise a for loop to erase each of the data flash blocks */
    for (loop_counter = 0; loop_counter < DF_NUM_BLOCKS; loop_counter++) {
        /* Fetch beginning address of DF block */
        address = block_addresses(BLOCK_DB0 + loop_counter);
        end_address = address + DF_BLOCK_SIZE-1;

        /* Does this address touch the range we are covering? */
        if (((address >= offset_address) && (address <= (offset_address + aSize)))
                || ((end_address >= offset_address)
                        && (end_address <= (offset_address + aSize)))) {
            /* Erase data flash block */
            ret |= R_FlashErase(block_count);

            /* Check if data flash area is blank */
            ret |= R_FlashDataAreaBlankCheck(address, BLANK_CHECK_ENTIRE_BLOCK);
        }
        /* Increment block counter */
        block_count++;
    }

    R_Flash_Status_Check(WAIT_MAX_DF_WRITE);

    return ret;
}

/*******************************************************************************
 * End of function Write_FlashData
 *******************************************************************************/

/*******************************************************************************
 * Outline      : InitADC_FlashData
 * Description  : This function configures the ADC unit for single shot operation
 *                 and sets the switch callback function to CB_Switch.
 * Argument     : none
 * Return value : none
 *******************************************************************************/
static void InitADC_FlashData(void)
{
    /* Set the initial flash write address to the start of block DB0 */
    gFlashWriteAddr = DF_START_ADDR;
}

/*-------------------------------------------------------------------------*
 * End of File:  Flash_RX63N.c
 *-------------------------------------------------------------------------*/
